'''
Тип 8 № 3693

Все 5-буквенные слова, составленные из 5 букв А, К, Л, О, Ш, записаны в алфавитном порядке.

Вот начало списка:

1.ААААА
2.ААААК
3.ААААЛ
4.ААААО
5.ААААШ
6.АААКА

……
На каком месте от начала списка стоит слово ШКОЛА?
'''

a = {0: "А", 1: "К", 2: "Л", 3: "О", 4: "Ш"}
k = 0
for i in range(0, len(a)):
    for j in range(0, len(a)):
        for g in range(0, len(a)):
            for m in range(0, len(a)):
                for n in range(0, len(a)):
                    k += 1
                    if a[i] == 'Ш' and a[j] == 'К' and  a[g] == 'О' and a[m] == 'Л' and a[n] == 'А':
                        print(k)
