'''
Тип 2 № 17320

Логическая функция F задаётся выражением ((x ∧ y) ∨ (y ∧ z)) ≡ ((x → w) ∧ (w → z)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

'''

def f(x, y, z, w): # создаём функцию
    return (((x and y) or (y and z)) == ((x <= w) and (w <= z))) * 1 # расписываем выражение ( ∧ переходит в and ; ∨ переходит в or ; ≡ переходит в == ; → переходит в <= )

for x in {0, 1}:
    for y in {0, 1}:
        for w in {0, 1}:
            for z in {0, 1}:
                print(x, y, z, w, f(x, y, z, w)) # полученные цифры отбираем по условию и верно подставляем в исходную таблицу
