'''
Тип 2 № 18808

Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ w.

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

'''


def f(x, y, z, w):
    return ((x and (not y)) or (y == z) or w) * 1 # # расписываем выражение ( ∧ переходит в and ; ¬y переходит в (not y) ; ∨ переходит в or ; ≡ переходит в == )

for x in {0, 1}:
    for y in {0, 1}:
        for w in {0, 1}:
            for z in {0, 1}:
                print(x, y, z, w, f(x, y, z, w))

